print("เมนูตัวดำเนินการ")
print("1. บวก")
print("2. ลบ")
print("3. คูณ")
print("4. หาร")
key = int(input("กดเลือก 1, 2, 3 หรือ 4 >>> "))
a = int(input("ป้อนข้อมูลตัวเลขที่ 1 >>> "))
b = int(input("ป้อนข้อมูลตัวเลขที่ 2 >>> "))
if key == 1:
    print("ผลบวกของ", a, "+", b, "=", (a + b))
elif key == 2:
    print("ผลลบของ", a, "-", b, "=", (a - b))
elif key == 3:
    print("ผลคูณของ", a, "*", b, "=", (a * b))
elif key == 4:
    print("ผลหารของ", a, "/", b, "=", (a / b))
else:
    print("พบข้อผิดพลาดในการเลือกตัวดำเนินการ!")
print("แล้วเจอกันใหม่!")


